In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3,4,5,"foo"],
                   [5,1,2,3,5,"boo"],
                   [1,2,3,4,"bar","bar"],
                   ])

In [4]:
df

   0  1  2  3    4    5
0  1  2  3  4    5  foo
1  5  1  2  3    5  boo
2  1  2  3  4  bar  bar

In [49]:
df = pd.DataFrame([["Boo",2,3,4,5,"foo"],
                   [5,2,2],
                   [1,2],
                   [1,None,2],
                   ])

In [50]:
df

     0    1    2    3    4     5
0  Boo  2.0  3.0  4.0  5.0   foo
1    5  2.0  2.0  NaN  NaN  None
2    1  2.0  NaN  NaN  NaN  None
3    1  NaN  2.0  NaN  NaN  None

In [51]:
df.columns = ["Col1", "Col2", "Col3", "Col4", "Col5", "Col6"]

In [52]:
df.columns = ["Col1", "Col2", "Col3", "Col4", 3, 4]

In [53]:
df

  Col1  Col2  Col3  Col4    3     4
0  Boo   2.0   3.0   4.0  5.0   foo
1    5   2.0   2.0   NaN  NaN  None
2    1   2.0   NaN   NaN  NaN  None
3    1   NaN   2.0   NaN  NaN  None

In [55]:
df.index = ["Linha 1", "Linha 2", "Linha 3", "Linha 4"]

In [56]:
df

        Col1  Col2  Col3  Col4    3     4
Linha 1  Boo   2.0   3.0   4.0  5.0   foo
Linha 2    5   2.0   2.0   NaN  NaN  None
Linha 3    1   2.0   NaN   NaN  NaN  None
Linha 4    1   NaN   2.0   NaN  NaN  None

In [57]:
df.dtypes

Col1     object
Col2    float64
Col3    float64
Col4    float64
3       float64
4        object
dtype: object

In [58]:
df.describe()

       Col2      Col3  Col4    3
count   3.0  3.000000   1.0  1.0
mean    2.0  2.333333   4.0  5.0
std     0.0  0.577350   NaN  NaN
min     2.0  2.000000   4.0  5.0
25%     2.0  2.000000   4.0  5.0
50%     2.0  2.000000   4.0  5.0
75%     2.0  2.500000   4.0  5.0
max     2.0  3.000000   4.0  5.0

In [61]:
df["Col2"].mean(skipna=True)

nan

In [66]:
df.mean(numeric_only=True)

Col2    2.000000
Col3    2.333333
Col4    4.000000
3       5.000000
dtype: float64

In [67]:
dict = {"Nome":["Joao", "Maria", "Rita"], "notas":[20,10,14]}
pd.DataFrame(dict)

    Nome  notas
0   Joao     20
1  Maria     10
2   Rita     14

In [68]:
df.shape

(4, 6)

In [119]:
dict = {"Nome":["Joao", "Maria", "Paula"], "nota":[20,10,14]}
df = pd.DataFrame(dict, index=["al1", "al2", "al3"])

nova_nota = {"Nome":["Marco", "Luis"], "Turma":[20,20]}
tempDF = pd.DataFrame(nova_nota, index=['al4', 'al5'])

In [102]:
df

      Nome  nota
al1   Joao    20
al2  Maria    10
al3  Paula    14

In [101]:
tempDF

      Nome  nota
al4  Marco    20
al5   Luis    20

In [85]:
novoDF = pd.concat([df,tempDF], axis=0)

In [82]:
novoDF

      Nome  nota
al1   Joao    20
al2  Maria    10
al3  Paula    14
al1  Marco    20
al2   Luis    20

In [121]:
novoDF = pd.concat([df,tempDF], axis=1)

```
    dict = {"Nome":["Joao", "Maria", "Paula"], "nota":[20,10,14]}
    df = pd.DataFrame(dict, index=["al1", "al2", "al3"])

    nova_nota = {"Nome":["Marco", "Luis"], "nota":[20,20]}
    tempDF = pd.DataFrame(nova_nota, index=['al4', 'al5'])
```

In [123]:
novoDF = pd.concat([df,tempDF], axis=0)
novoDF

      Nome  nota  Turma
al1   Joao  20.0    NaN
al2  Maria  10.0    NaN
al3  Paula  14.0    NaN
al4  Marco   NaN   20.0
al5   Luis   NaN   20.0

In [93]:
novoDF.reset_index(drop=True)

    Nome  nota
0   Joao    20
1  Maria    10
2  Paula    14
3  Marco    20
4   Luis    20

In [126]:
novoDF.isna().sum().sum()

5

In [130]:
novoDF["nota"].isna().sum()

2

In [134]:
novoDF["nota"].fillna(0, inplace=True)

In [139]:
novoDF.sort_values("nota", ascending=False)

      Nome  nota  Turma
al1   Joao  20.0    NaN
al3  Paula  14.0    NaN
al2  Maria  10.0    NaN
al4  Marco   0.0   20.0
al5   Luis   0.0   20.0

In [141]:
novoDF.query("nota >= 13")

      Nome  nota  Turma
al1   Joao  20.0    NaN
al3  Paula  14.0    NaN